{
  "auto_mapping": {
    "base_model_class": "UNet2DConditionModel",
    "parent_library": "diffusers.models.unet_2d_condition"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 27,
  "lora_dropout": 0.0,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "revision": null,
  "target_modules": [
    "to_k",
    "to_q",
    "to_v",
    "to_out.0"
  ],
  "task_type": null
}